micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_pwr_ex.c
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_pwr_ex.c
  * @author  MCD Application Team
  * @brief   Extended PWR HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Power Controller extension peripheral :
  *           + Power Supply Control Functions
  *           + Low Power Control Functions
  *           + Voltage Monitoring Functions
  *           + Memories Retention Functions
  *           + I/O Pull-Up Pull-Down Configuration Functions
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
   (#) Call HAL_PWREx_ConfigSupply() function to configure the regulator supply
       with the following different setups according to hardware:
       (+) PWR_SMPS_SUPPLY
       (+) PWR_EXTERNAL_SOURCE_SUPPLY

   (#) Call HAL_PWREx_GetSupplyConfig() function to get the current supply setup.

   (#) Call HAL_PWREx_ControlVoltageScaling() function to configure the main
       internal regulator output voltage. The voltage scaling could be one of
       the following scales :
       (+) PWR_REGULATOR_VOLTAGE_SCALE0
       (+) PWR_REGULATOR_VOLTAGE_SCALE1

   (#) Call HAL_PWREx_GetVoltageRange() function to get the current output
       voltage applied to the main regulator.

   (#) Call HAL_PWREx_ControlStopModeVoltageScaling() function to configure the main
       internal regulator output voltage in STOP mode. The voltage scaling could be one of
       the following scales :
       (+) PWR_REGULATOR_STOP_VOLTAGE_SCALE3
       (+) PWR_REGULATOR_STOP_VOLTAGE_SCALE5

   (#) Call HAL_PWREx_GetStopModeVoltageRange() function to get the current output
       voltage applied to the main regulator in STOP mode.

   (#) Call HAL_PWREx_EnableWakeUpPin() functions to enable the Wake-up pin
       functionality for the selected pin.

   (#) Call HAL_PWREx_EnableBkupRAMRetention() and HAL_PWREx_DisableBkupRAMRetention()
       functions to enable and disable BKPSRAM retention in Standby mode.

   (#) Call HAL_PWREx_EnableTCMRetention() and HAL_PWREx_DisableTCMRetention() functions
       to enable and disable the I-TCM and D-TCM RAMs retention in Standby mode.

   (#) Call HAL_PWREx_EnableTCMFLXRetention() and HAL_PWREx_DisableTCMFLXRetention()
       functions to enable and disable the I-TCM FLEXMEM retention in Standby mode.

   (#) Call HAL_PWREx_SetPulseLow() function to configure the minimum guaranteed
       duration of the pwr_on low pulse in Standby mode ( between ~ 0 -> 31 ms).

   (#) Call HAL_PWREx_GetPulseLow() function to get the minimum guaranteed
       duration of the pwr_on low pulse in Standby mode.

   (#) Call HAL_PWREx_EnableTCMFLXRetention() and HAL_PWREx_DisableTCMFLXRetention()
       functions to enable and disable the I-TCM FLEXMEM retention in Standby mode.

   (#) Call HAL_PWREx_EnableSMPSPWM() and HAL_PWREx_DisableSMPSPWM() functions to
       enable and disable the SMPS low-power mode in Stop SVOS range 3.

   (#) Call HAL_PWREx_EnablePullDownOutput() and HAL_PWREx_DisablePullDownOutput()
       functions to enable and disable the pull down on output voltage during
       power-down mode.

   (#) Call HAL_PWREx_EnableMonitoring() and HAL_PWREx_DisableMonitoring()
       functions to enable and disable the VBAT and Temperature monitoring.
       When VBAT and Temperature monitoring feature is enables, use
       HAL_PWREx_GetTemperatureLevel() and HAL_PWREx_GetVBATLevel() to get
       respectively the Temperature level and VBAT level.

   (#) Call HAL_PWREx_EnableVDDCOREMonitoring() and HAL_PWREx_EnableVDDCOREMonitoring()
       functions to enable and disable the VCORE monitoring.
       When VDDCORE monitoring feature is enables, use HAL_PWREx_GetVDDCORELevel()
       function to get the current VDDCORE level.

   (#) Call HAL_PWREx_ConfigVDDCORELevel() function to configure the VDDCORE
       voltage detector low-level selection.

   (#) Call HAL_PWREx_ConfigVddIORange() functions to configure the Vdd IO range:
       (+) PWR_VDDIO
       (+) PWR_VDDIO2
       (+) PWR_VDDIO3
       (+) PWR_VDDIO4
       (+) PWR_VDDIO5
       The voltage range setting could be one of the following values:
       (+) PWR_VDDIO_RANGE_3V3
       (+) PWR_VDDIO_RANGE_1V8

   (#) Call HAL_PWREx_GetVddIORange() function to get the current
       voltage range setting on the selected Vdd IO.

   (#) Call HAL_PWREx_EnableVddIO4RangeSTBY() and HAL_PWREx_DisableVddIO4RangeSTBY()
       functions to enable and disable the VDD IO4 voltage range Standby mode.

   (#) Call HAL_PWREx_EnableVddIO5RangeSTBY() and HAL_PWREx_DisableVddIO5RangeSTBY()
       functions to enable and disable the VDD IO5 voltage range Standby mode.

   (#) Call HAL_PWREx_EnableVddUSB() and HAL_PWREx_DisableVddUSB()
       functions to enable and disable the VDD33USB supply valid.

   (#) Call HAL_PWREx_EnableVddIO2() and HAL_PWREx_DisableVddIO2()
       functions to enable and disable the VDDIO2 supply valid.

   (#) Call HAL_PWREx_EnableVddIO3() and HAL_PWREx_DisableVddIO3()
       functions to enable and disable the VDDIO3 supply valid.

   (#) Call HAL_PWREx_EnableVddIO4() and HAL_PWREx_DisableVddIO4()
       functions to enable and disable the VDDIO4 supply valid.

   (#) Call HAL_PWREx_EnableVddIO5() and HAL_PWREx_DisableVddIO5()
       functions to enable and disable the VDDIO5 supply valid.

