micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_pwr_ex.c
      By setting the TCMFLXRBSEN bit in the PWR_CR4 register using the
      HAL_PWREx_EnableTCMFLXRetention () function, the content of these memories
      are retained even in Standby mode.

@endverbatim
  * @{
  */

/**
  * @brief  Enable the Backup RAM retention in Standby and VBAT modes.
  * @note  After reset, PWR_BDCR2 is write-protected.
  *        DBP must be set in PWR_DBPCR to disable the write protection.
  * @retval None.
  */
void HAL_PWREx_EnableBkupRAMRetention(void)
{
  SET_BIT(PWR->BDCR2, PWR_BDCR2_BKPRBSEN);
}

/**
  * @brief  Disable the Backup RAM retention in Standby and VBAT modes.
  * @note  After reset, PWR_BDCR2 is write-protected.
  *        DBP must be set in PWR_DBPCR to disable the write protection.
  * @retval None.
  */
void HAL_PWREx_DisableBkupRAMRetention(void)
{
  CLEAR_BIT(PWR->BDCR2, PWR_BDCR2_BKPRBSEN);
}

/**
  * @brief Enable the TCM RAMs retention in Standby mode.
  * @retval None.
  */
void HAL_PWREx_EnableTCMRetention(void)
{
  SET_BIT(PWR->CR4, PWR_CR4_TCMRBSEN);
}

/**
  * @brief Disable the TCM RAMs retention in Standby mode.
  * @retval None.
  */
void HAL_PWREx_DisableTCMRetention(void)
{
  CLEAR_BIT(PWR->CR4, PWR_CR4_TCMRBSEN);
}

/**
  * @brief Enable the I-TCM FLEXMEM retention in Standby mode.
  * @retval None.
  */
void HAL_PWREx_EnableTCMFLXRetention(void)
{
  SET_BIT(PWR->CR4, PWR_CR4_TCMFLXRBSEN);
}

/**
  * @brief Disable the I-TCM FLEXMEM retention in Standby mode.
  * @retval None.
  */
void HAL_PWREx_DisableTCMFLXRetention(void)
{
  CLEAR_BIT(PWR->CR4, PWR_CR4_TCMFLXRBSEN);
}
/**
  * @}
  */


/** @defgroup PWREx_Exported_Functions_Group4 Low Power Control Functions
  * @brief    Low Power Control Functions
  *
@verbatim
 ===============================================================================
                     ##### Low Power Control Functions #####
 ===============================================================================
    [..]
@endverbatim
  * @{
  */

/**
  * @brief Configure the pwr_on pulse low configuration.
  * @param  Pulselowtime : Specifies minimum guaranteed duration of
                           the pwr_on low pulse in Standby mode.
  *          This parameter can be a value between 0 and 31:
  *            0: No guaranteed minimum low time.
  *            1: 1* 32 LSI cycles= ~ 1 ms guaranteed minimum low time.
  *            X: X* 32 LSI cycles= ~ X ms guaranteed minimum low time.
  * @retval None.
  */
void HAL_PWREx_SetPulseLow(uint32_t Pulselowtime)
{
  assert_param(IS_PWR_PULSE_LOW_TIME(Pulselowtime));

  /* Set the pwr_on pulse low configuration */
  MODIFY_REG(PWR->CR1, PWR_CR1_POPL_Msk, (Pulselowtime << PWR_CR1_POPL_Pos));
}

/**
  * @brief Get the pwr_on pulse low configuration.
  * @retval The actual applied minimum guaranteed duration of the
  *         pwr_on low pulse in Standby mode.
  */
uint32_t HAL_PWREx_GetPulseLow(void)
{
  /* Return the stop voltage scaling */
  return ((PWR->CR1 & PWR_CR1_POPL_Msk) >> PWR_CR1_POPL_Pos);
}

/**
  * @brief  Enable SMPS low-power mode (SVOS range 3 only).
  * @note   LPDS08V bit is used to keep the SMPS in PWM mode (MR) in Stop SVOS range 3.
  * @retval None.
  */
void HAL_PWREx_EnableSMPSPWM(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_LPDS08V);
}

/**
  * @brief  Disable SMPS low-power mode (SVOS range 3 only).
  * @retval None.
  */
void HAL_PWREx_DisableSMPSPWM(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_LPDS08V);
}

/**
  * @brief  Enable the pull down on output voltage during power-down mode.
  * @retval None.
  */
void HAL_PWREx_EnablePullDownOutput(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_MODE_PDN);
}

/**
  * @brief  Disable the pull down on output voltage during power-down mode.
  * @retval None.
  */
void HAL_PWREx_DisablePullDownOutput(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_MODE_PDN);
}
/**
  * @}
  */

/** @defgroup PWREx_Exported_Functions_Group5 Power Monitoring functions
  * @brief    Power Monitoring functions
  *
@verbatim
 ===============================================================================
                 ##### Power Monitoring functions #####
 ===============================================================================

    *** VBAT and Temperature supervision ***
    ========================================
    [..]
      (+) The VBAT battery voltage supply can be monitored by comparing it with
          two threshold levels: VBAThigh and VBATlow. VBATH flag and VBATL flags
          in the PWR control register 2 (PWR_BDCR1), indicate if VBAT is higher or
          lower than the threshold.
      (+) The temperature can be monitored by comparing it with two threshold
          levels, TEMPhigh and TEMPlow. TEMPH and TEMPL flags, in the PWR
          control register 2 (PWR_BDCR1), indicate whether the device temperature
          is higher or lower than the threshold.
      (+) The VBAT and the temperature monitoring is enabled by
          HAL_PWREx_EnableMonitoring() function and disabled by
          HAL_PWREx_DisableMonitoring() function.
      (+) The HAL_PWREx_GetVBATLevel() function returns the VBAT level which can
          be : PWR_VBAT_BELOW_LOW_THRESHOLD or PWR_VBAT_ABOVE_HIGH_THRESHOLD or
          PWR_VBAT_BETWEEN_HIGH_LOW_THRESHOLD.
      (+) The HAL_PWREx_GetTemperatureLevel() function returns the Temperature
          level which can be :
          PWR_TEMP_BELOW_LOW_THRESHOLD or PWR_TEMP_ABOVE_HIGH_THRESHOLD or
          PWR_TEMP_BETWEEN_HIGH_LOW_THRESHOLD.

@endverbatim
  * @{
  */

/**
  * @brief Enable the VBAT and temperature monitoring.
  * @note  After reset, PWR_BDCR1 is write-protected.
  *        DBP must be set in PWR_DBPCR to disable the write protection.
  * @retval HAL status.
  */
void HAL_PWREx_EnableMonitoring(void)
{
  /* Enable the VBAT and Temperature monitoring */
  SET_BIT(PWR->BDCR1, PWR_BDCR1_MONEN);
}

/**
  * @brief Disable the VBAT and temperature monitoring.
  * @note  After reset, PWR_BDCR1 is write-protected.
  *        DBP must be set in PWR_DBPCR to disable the write protection.
  * @retval HAL status.
  */
void HAL_PWREx_DisableMonitoring(void)
{
  /* Disable the VBAT and Temperature monitoring */
  CLEAR_BIT(PWR->BDCR1, PWR_BDCR1_MONEN);
}

/**
  * @brief Indicate whether the junction temperature is between, above or below
  *        the thresholds.
  * @retval Temperature level.
  */
uint32_t HAL_PWREx_GetTemperatureLevel(void)
{
  uint32_t tempLevel;
  uint32_t regValue;

