micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_pwr_ex.c
  /* Read the temperature flags */
  regValue = READ_BIT(PWR->BDCR1, (PWR_BDCR1_TEMPH | PWR_BDCR1_TEMPL));

  /* Check if the temperature is below the threshold */
  if (regValue == PWR_BDCR1_TEMPL)
  {
    tempLevel = PWR_TEMP_BELOW_LOW_THRESHOLD;
  }
  /* Check if the temperature is above the threshold */
  else if (regValue == PWR_BDCR1_TEMPH)
  {
    tempLevel = PWR_TEMP_ABOVE_HIGH_THRESHOLD;
  }
  /* The temperature is between the thresholds */
  else
  {
    tempLevel = PWR_TEMP_BETWEEN_HIGH_LOW_THRESHOLD;
  }

  return tempLevel;
}

/**
  * @brief Indicate whether the Battery voltage level is between, above or below
  *        the thresholds.
  * @retval VBAT level.
  */
uint32_t HAL_PWREx_GetVBATLevel(void)
{
  uint32_t vbatLevel;
  uint32_t regValue;

  /* Read the VBAT flags */
  regValue = READ_BIT(PWR->BDCR1, (PWR_BDCR1_VBATH | PWR_BDCR1_VBATL));

  /* Check if the VBAT is below the threshold */
  if (regValue == PWR_BDCR1_VBATL)
  {
    vbatLevel = PWR_VBAT_BELOW_LOW_THRESHOLD;
  }
  /* Check if the VBAT is above the threshold */
  else if (regValue == PWR_BDCR1_VBATH)
  {
    vbatLevel = PWR_VBAT_ABOVE_HIGH_THRESHOLD;
  }
  /* The VBAT is between the thresholds */
  else
  {
    vbatLevel = PWR_VBAT_BETWEEN_HIGH_LOW_THRESHOLD;
  }

  return vbatLevel;
}

/**
  * @brief Enable the VDDCORE monitoring.
  * @retval HAL status.
  */
void HAL_PWREx_EnableVDDCOREMonitoring(void)
{
  /* Enable the VDDCORE monitoring */
  SET_BIT(PWR->CR3, PWR_CR3_VCOREMONEN);
}

/**
  * @brief Disable the VDDCORE monitoring.
  * @retval HAL status.
  */
void HAL_PWREx_DisableVDDCOREMonitoring(void)
{
  /* Disable the VDDCORE monitoring */
  CLEAR_BIT(PWR->CR3, PWR_CR3_VCOREMONEN);
}

/**
  * @brief  Configure the VDDCORE voltage detector low-level selection.
  * @param  pConfigVddCOREVM : Pointer to a PWR_VddCOREVMTypeDef structure that contains the
  *                            PVM configuration information (LowVoltageThreshold and Mode).
  * @retval None.
  */
void HAL_PWREx_ConfigVDDCOREVM(const PWR_VddCOREVMTypeDef *pConfigVddCOREVM)
{
  assert_param(IS_PWR_VDDCOREVM_LEVEL(pConfigVddCOREVM->LowVoltageThreshold));
  assert_param(IS_PWR_VDDCOREVM_MODE(pConfigVddCOREVM->Mode));

  /* Disable VDDCORE monitoring Event/Interrupt */
  __HAL_PWR_VCOREVM_EXTI_DISABLE_EVENT();
  __HAL_PWR_VCOREVM_EXTI_DISABLE_IT();
  __HAL_PWR_VCOREVM_EXTI_DISABLE_RISING_EDGE();
  __HAL_PWR_VCOREVM_EXTI_DISABLE_FALLING_EDGE();

  /* Set the VDDCORE voltage detector low-level selection */
  MODIFY_REG(PWR->CR3, PWR_CR3_VCORELLS_Msk, pConfigVddCOREVM->LowVoltageThreshold);

  /* Configure the VDDCORE monitoring in interrupt mode */
  if ((pConfigVddCOREVM->Mode & VDDCOREVM_MODE_IT) == VDDCOREVM_MODE_IT)
  {
    __HAL_PWR_VCOREVM_EXTI_ENABLE_IT();
  }

  /* Configure the VDDCORE monitoring in event mode */
  if ((pConfigVddCOREVM->Mode & VDDCOREVM_MODE_EVT) == VDDCOREVM_MODE_EVT)
  {
    __HAL_PWR_VCOREVM_EXTI_ENABLE_EVENT();
  }

  /* Rising edge configuration */
  if ((pConfigVddCOREVM->Mode & VDDCOREVM_RISING_EDGE) == VDDCOREVM_RISING_EDGE)
  {
    __HAL_PWR_VCOREVM_EXTI_ENABLE_RISING_EDGE();
  }

  /* Falling edge configuration */
  if ((pConfigVddCOREVM->Mode & VDDCOREVM_FALLING_EDGE) == VDDCOREVM_FALLING_EDGE)
  {
    __HAL_PWR_VCOREVM_EXTI_ENABLE_FALLING_EDGE();
  }
}

/**
  * @brief Indicate whether the VDDCORE level is between, above or below
  *        the thresholds.
  * @retval VDDCORE level.
  */
uint32_t HAL_PWREx_GetVDDCORELevel(void)
{
  uint32_t vcoreLevel;
  uint32_t regValue;

  /* Read the VCORE flags */
  regValue = READ_BIT(PWR->CR3, (PWR_CR3_VCOREH | PWR_CR3_VCOREL));

  /* Check if the VCORE is below the threshold */
  if (regValue == PWR_CR3_VCOREL)
  {
    vcoreLevel = PWR_VDDCORE_BELOW_LOW_THRESHOLD;
  }
  /* Check if the VCORE is above the threshold */
  else if (regValue == PWR_CR3_VCOREH)
  {
    vcoreLevel = PWR_VDDCORE_ABOVE_HIGH_THRESHOLD;
  }
  /* The VCORE is between the thresholds */
  else
  {
    vcoreLevel = PWR_VDDCORE_BETWEEN_HIGH_LOW_THRESHOLD;
  }

  return vcoreLevel;
}

/**
  * @brief  Configure the VDD I/O voltage range.
  * @param  VddIOPort VDD I/O
  *         This parameter can be one of the following values:
  *           @arg @ref PWR_VDDIO           Vdd IO
  *           @arg @ref PWR_VDDIO2          Vdd IO2
  *           @arg @ref PWR_VDDIO3          Vdd IO3
  *           @arg @ref PWR_VDDIO4          Vdd IO4
  *           @arg @ref PWR_VDDIO5          Vdd IO5
  * @param  VoltageRange Voltage range
  *         This parameter can be one of the following values:
  *           @arg @ref PWR_VDDIO_RANGE_3V3   3v3 voltage range
  *           @arg @ref PWR_VDDIO_RANGE_1V8   1v8 voltage range
  * @note   HSLV_VDDIOx option bit must be set to allow 1v8 voltage
  *         range operation.
  * @note   Setting this configuration while VDDIOx is in 3v3 range
  *         damages the device.
  * @retval None.
  */
void HAL_PWREx_ConfigVddIORange(uint32_t VddIOPort, uint32_t VoltageRange)
{
  /* Check the parameters */
  assert_param(IS_PWR_VDDIO(VddIOPort));
  assert_param(IS_PWR_VDDIO_RANGE(VoltageRange));

  switch (VddIOPort)
  {
    case PWR_VDDIO:
      MODIFY_REG(PWR->SVMCR3, PWR_SVMCR3_VDDIOVRSEL, VoltageRange << PWR_SVMCR3_VDDIOVRSEL_Pos);
      break;

    case PWR_VDDIO2:
      MODIFY_REG(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VRSEL, VoltageRange << PWR_SVMCR3_VDDIO2VRSEL_Pos);
      break;

    case PWR_VDDIO3:
      MODIFY_REG(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VRSEL, VoltageRange << PWR_SVMCR3_VDDIO3VRSEL_Pos);
      break;

    case PWR_VDDIO4:
      MODIFY_REG(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSEL, VoltageRange << PWR_SVMCR1_VDDIO4VRSEL_Pos);
      break;

    case PWR_VDDIO5:
      MODIFY_REG(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSEL, VoltageRange << PWR_SVMCR2_VDDIO5VRSEL_Pos);
      break;

    default:
      break;
  }
}

/**
  * @brief  Configure the VDD I/O voltage range.
  * @param  VddIOPort VDD I/O
  *         This parameter can be one of the following values:
  *           @arg @ref PWR_VDDIO           Vdd IO
  *           @arg @ref PWR_VDDIO2          Vdd IO2
  *           @arg @ref PWR_VDDIO3          Vdd IO3
  *           @arg @ref PWR_VDDIO4          Vdd IO4
  *           @arg @ref PWR_VDDIO5          Vdd IO5
  * @retval The voltage range:
  *           @arg @ref PWR_VDDIO_RANGE_3V3   3v3 voltage range
  *           @arg @ref PWR_VDDIO_RANGE_1V8   1v8 voltage range
  */
uint32_t HAL_PWREx_GetVddIORange(uint32_t VddIOPort)
{
  uint32_t voltage_range = 0U;

  /* Check the parameters */
  assert_param(IS_PWR_VDDIO(VddIOPort));

  switch (VddIOPort)
  {
    case PWR_VDDIO:
      voltage_range = (READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIOVRSEL) >> PWR_SVMCR3_VDDIOVRSEL_Pos);
      break;

