micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_pwr_ex.c
    case PWR_VDDIO2:
      voltage_range = (READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VRSEL) >> PWR_SVMCR3_VDDIO2VRSEL_Pos);
      break;

    case PWR_VDDIO3:
      voltage_range = (READ_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VRSEL) >> PWR_SVMCR3_VDDIO3VRSEL_Pos);
      break;

    case PWR_VDDIO4:
      voltage_range = (READ_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSEL) >> PWR_SVMCR1_VDDIO4VRSEL_Pos);
      break;

    case PWR_VDDIO5:
      voltage_range = (READ_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSEL) >> PWR_SVMCR2_VDDIO5VRSEL_Pos);
      break;

    default:
      break;
  }
  return voltage_range;
}

/**
  * @brief  Enable VDD IO4 voltage range Standby mode.
  * @note   When this bit is set, the VDDIO4VRSEL configuration
  *         is retained in Standby mode.
  * @note   This bit must be set if the VDDIO4 is in 1v8 range
  *         in Standby mode, and when exiting Standby mode.
  * @note   It must not be set when VDDIO4 is in 3v3 range in
  *         Standby mode, or when exiting Standby mode.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO4RangeSTBY(void)
{
  SET_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSTBY);
}

/**
  * @brief  Disable VDD IO4 voltage range Standby mode.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO4RangeSTBY(void)
{
  CLEAR_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VRSTBY);
}

/**
  * @brief  Enable VDD IO5 voltage range Standby mode.
  * @note   When this bit is set, the VDDIO5VRSEL configuration
  *         is retained in Standby mode.
  * @note   This bit must be set if the VDDIO5 is in 1v8 range
  *         in Standby mode, and when exiting Standby mode.
  * @note   It must not be set when VDDIO5 is in 3v3 range in
  *         Standby mode, or when exiting Standby mode.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO5RangeSTBY(void)
{
  SET_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSTBY);
}

/**
  * @brief  Disable VDD IO5 voltage range Standby mode.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO5RangeSTBY(void)
{
  CLEAR_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VRSTBY);
}

/**
  * @brief  Enable VDDUSB supply valid.
  * @note   Setting this bit is mandatory to use the USB2 HS PHYs.
  *         is present for consumption saving.
  * @retval None.
  */
void HAL_PWREx_EnableVddUSB(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33SV);
}

/**
  * @brief  Disable VDDUSB supply valid.
  * @retval None.
  */
void HAL_PWREx_DisableVddUSB(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33SV);
}

/**
  * @brief  Enable VDDIO2 supply valid.
  * @note   Setting this bit is mandatory to use PO[5:0] and PP[15:0] I/Os.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO2(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2SV);
}

/**
  * @brief  Disable VDDIO2 supply valid.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO2(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2SV);
}

/**
  * @brief  Enable VDDIO3 supply valid.
  * @note   Setting this bit is mandatory to use PN[12:0] I/Os.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO3(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3SV);
}

/**
  * @brief  Disable VDDIO3 supply valid.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO3(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3SV);
}

/**
  * @brief  Enable VDDIO4 supply valid.
  * @note   Setting this bit is mandatory to use PB[9,8], PC[12:6], and PD[2] I/Os.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO4(void)
{
  SET_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4SV);
}

/**
  * @brief  Disable VDDIO4 supply valid.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO4(void)
{
  CLEAR_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4SV);
}

/**
  * @brief  Enable VDDIO5 supply valid.
  * @note   Setting this bit is mandatory to use PN[12:0] I/Os.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO5(void)
{
  SET_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5SV);
}

/**
  * @brief  Disable VDDIO5 supply valid.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO5(void)
{
  CLEAR_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5SV);
}

/**
  * @brief  Enable VDDA supply valid.
  * @note   Setting this bit is mandatory to use the analog to digital converters.
  * @retval None.
  */
void HAL_PWREx_EnableVddA(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_ASV);
}

/**
  * @brief  Disable VDDA supply valid.
  * @retval None.
  */
void HAL_PWREx_DisableVddA(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_ASV);
}

/**
  * @brief  Enable the VDD33USB independent USB 33 voltage monitor.
  * @retval None.
  */
void HAL_PWREx_EnableVddUSBVMEN(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33VMEN);
}

/**
  * @brief  Disable the VDD33USB independent USB 33 voltage monitor.
  * @retval None.
  */
void HAL_PWREx_DisableVddUSBVMEN(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_USB33VMEN);
}

/**
  * @brief  Enable the VDDIO2 independent voltage monitor.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO2VMEN(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VMEN);
}

/**
  * @brief  Disable the VDDIO2 independent voltage monitor.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO2VMEN(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO2VMEN);
}

/**
  * @brief  Enable the VDDIO3 independent voltage monitor.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO3VMEN(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VMEN);
}

/**
  * @brief  Disable the VDDIO3 independent voltage monitor.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO3VMEN(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_VDDIO3VMEN);
}

/**
  * @brief  Enable the VDDIO4 independent voltage monitor.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO4VMEN(void)
{
  SET_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VMEN);
}

/**
  * @brief  Disable the VDDIO4 independent voltage monitor.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO4VMEN(void)
{
  CLEAR_BIT(PWR->SVMCR1, PWR_SVMCR1_VDDIO4VMEN);
}

/**
  * @brief  Enable the VDDIO5 independent voltage monitor.
  * @retval None.
  */
void HAL_PWREx_EnableVddIO5VMEN(void)
{
  SET_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VMEN);
}

/**
  * @brief  Disable the VDDIO5 independent voltage monitor.
  * @retval None.
  */
void HAL_PWREx_DisableVddIO5VMEN(void)
{
  CLEAR_BIT(PWR->SVMCR2, PWR_SVMCR2_VDDIO5VMEN);
}

/**
  * @brief  Enable the VDDA18ADC independent ADC voltage monitor.
  * @retval None.
  */
void HAL_PWREx_EnableVddAVMEN(void)
{
  SET_BIT(PWR->SVMCR3, PWR_SVMCR3_AVMEN);
}

/**
  * @brief  Disable the VDDA18ADC independent ADC voltage monitor.
  * @retval None.
  */
void HAL_PWREx_DisableVddAVMEN(void)
{
  CLEAR_BIT(PWR->SVMCR3, PWR_SVMCR3_AVMEN);
}

/**
  * @brief  Configure the voltage monitor threshold detected by the Peripheral
  *         voltage monitoring (PVM).
  * @param  pConfigPVM : Pointer to a PWR_PVMTypeDef structure that contains the
  *                      PVM configuration information (PVMType and EventMode).
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_PWREx_ConfigPVM(const PWR_PVMTypeDef *pConfigPVM)
{

  /* Check the parameters */
  assert_param(IS_PWR_PVM_TYPE(pConfigPVM->PVMType));
  assert_param(IS_PWR_PVM_MODE(pConfigPVM->Mode));

  /* Check the peripheral voltage monitor type */
  switch (pConfigPVM->PVMType)
  {
    case PWR_VDDUSB_VM: /* Independent USB voltage monitor */

      /* Disable EXTI USBVM event and interrupt */
      __HAL_PWR_USBVM_EXTI_DISABLE_EVENT();
      __HAL_PWR_USBVM_EXTI_DISABLE_IT();
      __HAL_PWR_USBVM_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_USBVM_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the USBVM in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_USBVM_EXTI_ENABLE_IT();
      }

      /* Configure the USBVM in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_USBVM_EXTI_ENABLE_EVENT();
      }

