micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_pwr_ex.c
      /* Configure the USBVM in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_USBVM_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the USBVM in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_USBVM_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

    case PWR_VDDIO2_VM: /* Independent I/Os voltage monitor */

      /* Disable EXTI IO2VM event and interrupt */
      __HAL_PWR_IO2VM_EXTI_DISABLE_EVENT();
      __HAL_PWR_IO2VM_EXTI_DISABLE_IT();
      __HAL_PWR_IO2VM_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_IO2VM_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the IO2VM in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_IO2VM_EXTI_ENABLE_IT();
      }

      /* Configure the IO2VM in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_IO2VM_EXTI_ENABLE_EVENT();
      }

      /* Configure the IO2VM in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_IO2VM_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the IO2VM in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_IO2VM_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

    case PWR_VDDIO3_VM: /* Independent I/Os voltage monitor */

      /* Disable EXTI IO3VM event and interrupt */
      __HAL_PWR_IO3VM_EXTI_DISABLE_EVENT();
      __HAL_PWR_IO3VM_EXTI_DISABLE_IT();
      __HAL_PWR_IO3VM_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_IO3VM_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the IO3VM in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_IO3VM_EXTI_ENABLE_IT();
      }

      /* Configure the IO3VM in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_IO3VM_EXTI_ENABLE_EVENT();
      }

      /* Configure the IO3VM in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_IO3VM_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the IO3VM in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_IO3VM_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

    case PWR_VDDIO4_VM: /* Independent I/Os voltage monitor */

      /* Disable EXTI IO4VM event and interrupt */
      __HAL_PWR_IO4VM_EXTI_DISABLE_EVENT();
      __HAL_PWR_IO4VM_EXTI_DISABLE_IT();
      __HAL_PWR_IO4VM_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_IO4VM_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the IO4VM in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_IO4VM_EXTI_ENABLE_IT();
      }

      /* Configure the IO4VM in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_IO4VM_EXTI_ENABLE_EVENT();
      }

      /* Configure the IO4VM in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_IO4VM_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the IO4VM in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_IO4VM_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

    case PWR_VDDIO5_VM: /* Independent I/Os voltage monitor */

      /* Disable EXTI IO5VM event and interrupt */
      __HAL_PWR_IO5VM_EXTI_DISABLE_EVENT();
      __HAL_PWR_IO5VM_EXTI_DISABLE_IT();
      __HAL_PWR_IO5VM_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_IO5VM_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the IO5VM in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_IO5VM_EXTI_ENABLE_IT();
      }

      /* Configure the IO5VM in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_IO5VM_EXTI_ENABLE_EVENT();
      }

      /* Configure the IO5VM in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_IO5VM_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the IO5VM in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_IO5VM_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

    case PWR_VDDA_VM: /* Independent ADC voltage monitor */

      /* Disable EXTI ADCVM event and interrupt */
      __HAL_PWR_ADCVM_EXTI_DISABLE_EVENT();
      __HAL_PWR_ADCVM_EXTI_DISABLE_IT();
      __HAL_PWR_ADCVM_EXTI_DISABLE_RISING_EDGE();
      __HAL_PWR_ADCVM_EXTI_DISABLE_FALLING_EDGE();

      /* Configure the ADCVM in interrupt mode */
      if ((pConfigPVM->Mode & PVM_MODE_IT) == PVM_MODE_IT)
      {
        __HAL_PWR_ADCVM_EXTI_ENABLE_IT();
      }

      /* Configure the ADCVM in event mode */
      if ((pConfigPVM->Mode & PVM_MODE_EVT) == PVM_MODE_EVT)
      {
        __HAL_PWR_ADCVM_EXTI_ENABLE_EVENT();
      }

      /* Configure the ADCVM in rising edge */
      if ((pConfigPVM->Mode & PVM_RISING_EDGE) == PVM_RISING_EDGE)
      {
        __HAL_PWR_ADCVM_EXTI_ENABLE_RISING_EDGE();
      }

      /* Configure the ADCVM in falling edge */
      if ((pConfigPVM->Mode & PVM_FALLING_EDGE) == PVM_FALLING_EDGE)
      {
        __HAL_PWR_ADCVM_EXTI_ENABLE_FALLING_EDGE();
      }
      break;

    default: /* No valid voltage monitor selected */
      return HAL_ERROR;
      break;
  }

  return HAL_OK;
}

/**
  * @brief  This function handles the PWR PVD/PVM interrupt request.
  * @retval None.
  */
void HAL_PWREx_PVD_PVM_IRQHandler(void)
{
  uint32_t  rising_flag;
  uint32_t  falling_flag;

  rising_flag  = READ_REG(EXTI->RPR3);
  falling_flag = READ_REG(EXTI->FPR3);

  /* Check PWR VDDCORE monitoring exti rising flag */
  if ((rising_flag & PWR_EXTI_LINE_VCOREVM) != 0U)
  {
    /* Clear VDDCORE monitoring exti pending bit */
    __HAL_PWR_VCOREVM_EXTI_CLEAR_RISING_FLAG();

    /* PWR VDDCORE monitoring interrupt rising user callback */
    HAL_PWREx_VDDCORE_Rising_Callback();
  }

  /* Check PWR VDDCORE monitoring exti falling flag */
  if ((falling_flag & PWR_EXTI_LINE_VCOREVM) != 0U)
  {
    /* Clear VDDCORE monitoring exti pending bit */
    __HAL_PWR_VCOREVM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR VDDCORE monitoring interrupt falling user callback */
    HAL_PWREx_VDDCORE_Falling_Callback();
  }

  /* Check PWR PVD exti rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVD) != 0U)
  {
    /* Clear PVD exti pending bit */
    __HAL_PWR_PVD_EXTI_CLEAR_RISING_FLAG();

