micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_pwr_ex.c
    /* PWR PVD interrupt rising user callback */
    HAL_PWR_PVD_Rising_Callback();
  }

  /* Check PWR PVD exti falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVD) != 0U)
  {
    /* Clear PVD exti pending bit */
    __HAL_PWR_PVD_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVD interrupt falling user callback */
    HAL_PWR_PVD_Falling_Callback();
  }

  /* Check PWR PVM USB exti rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDUSB) != 0U)
  {
    /* Clear PVM USB exti pending bit */
    __HAL_PWR_USBVM_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM USB interrupt rising user callback */
    HAL_PWREx_USBVM_Rising_Callback();
  }

  /* Check PWR PVM USB exti falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDUSB) != 0U)
  {
    /* Clear PVM USB exti pending bit */
    __HAL_PWR_USBVM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM USB interrupt falling user callback */
    HAL_PWREx_USBVM_Falling_Callback();
  }

  /* Check PWR PVM IO2 exti rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDIO2) != 0U)
  {
    /* Clear PVM IO2 exti pending bit */
    __HAL_PWR_IO2VM_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM IO2 interrupt rising user callback */
    HAL_PWREx_IO2VM_Rising_Callback();
  }

  /* Check PWR PVM IO2 exti falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDIO2) != 0U)
  {
    /* Clear PVM IO2 exti pending bit */
    __HAL_PWR_IO2VM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM IO2 interrupt falling user callback */
    HAL_PWREx_IO2VM_Falling_Callback();
  }

  /* Check PWR PVM IO3 exti rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDIO3) != 0U)
  {
    /* Clear PVM IO3 exti pending bit */
    __HAL_PWR_IO3VM_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM IO3 interrupt rising user callback */
    HAL_PWREx_IO3VM_Rising_Callback();
  }

  /* Check PWR PVM IO3 exti falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDIO3) != 0U)
  {
    /* Clear PVM IO3 exti pending bit */
    __HAL_PWR_IO3VM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM IO3 interrupt falling user callback */
    HAL_PWREx_IO3VM_Falling_Callback();
  }

  /* Check PWR PVM IO4 exti rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDIO4) != 0U)
  {
    /* Clear PVM IO4 exti pending bit */
    __HAL_PWR_IO4VM_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM IO4 interrupt rising user callback */
    HAL_PWREx_IO4VM_Rising_Callback();
  }

  /* Check PWR PVM IO4 exti falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDIO4) != 0U)
  {
    /* Clear PVM IO4 exti pending bit */
    __HAL_PWR_IO4VM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM IO4 interrupt falling user callback */
    HAL_PWREx_IO4VM_Falling_Callback();
  }

  /* Check PWR PVM IO5 exti rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDIO5) != 0U)
  {
    /* Clear PVM IO5 exti pending bit */
    __HAL_PWR_IO5VM_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM IO5 interrupt rising user callback */
    HAL_PWREx_IO5VM_Rising_Callback();
  }

  /* Check PWR PVM IO5 exti falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDIO5) != 0U)
  {
    /* Clear PVM IO5 exti pending bit */
    __HAL_PWR_IO5VM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM IO5 interrupt falling user callback */
    HAL_PWREx_IO5VM_Falling_Callback();

  }

  /* Check PWR PVM ADC VM exti rising flag */
  if ((rising_flag & PWR_EXTI_LINE_PVM_VDDA) != 0U)
  {
    /* Clear PVM ADC VM exti pending bit */
    __HAL_PWR_ADCVM_EXTI_CLEAR_RISING_FLAG();

    /* PWR PVM ADC VM interrupt rising user callback */
    HAL_PWREx_ADCVM_Rising_Callback();
  }

  /* Check PWR PVM ADC VM exti falling flag */
  if ((falling_flag & PWR_EXTI_LINE_PVM_VDDA) != 0U)
  {
    /* Clear PVM ADC VM exti pending bit */
    __HAL_PWR_ADCVM_EXTI_CLEAR_FALLING_FLAG();

    /* PWR PVM ADC VM interrupt falling user callback */
    HAL_PWREx_ADCVM_Falling_Callback();
  }
}

/**
  * @brief  PWR VDDCORE interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWREx_VDDCORE_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_VDDCORE_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR VDDCORE interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWREx_VDDCORE_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_VDDCORE_Falling_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR USBVM interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWREx_USBVM_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_USBVM_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR USBVM interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWREx_USBVM_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_USBVM_Falling_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO2VM interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWREx_IO2VM_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_IO2VM_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO2VM interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWREx_IO2VM_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_IO2VM_Falling_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO3VM interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWREx_IO3VM_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_IO3VM_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO3VM interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWREx_IO3VM_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_IO3VM_Falling_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO4VM interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWREx_IO4VM_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_IO4VM_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO4VM interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWREx_IO4VM_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_IO4VM_Falling_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO5VM interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWREx_IO5VM_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_IO5VM_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR IO5VM interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWREx_IO5VM_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_IO5VM_Falling_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR ADCVM interrupt Rising callback.
  * @retval None.
  */
__weak void HAL_PWREx_ADCVM_Rising_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_ADCVM_Rising_Callback() API can be implemented in the user file
   */
}

/**
  * @brief  PWR ADCVM interrupt Falling callback.
  * @retval None.
  */
__weak void HAL_PWREx_ADCVM_Falling_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_ADCVM_Falling_Callback() API can be implemented in the user file
   */
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


#endif /* defined (HAL_PWR_MODULE_ENABLED) */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
